### pandas basic

In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1 = {
    "Name" : ["Asim", "Najim", "Salim", "Faizan"],
    "Marks" : [80, 90, 85, 70],
    "City" : ["Amroha", "Moradabad", "Delhi", "Meerut"]
}

### how to make data frame

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

     Name  Marks       City
0    Asim     80     Amroha
1   Najim     90  Moradabad
2   Salim     85      Delhi
3  Faizan     70     Meerut

In [5]:
df.to_csv('Data.csv', index=False)

In [6]:
df.to_excel('Bro.xlsx')

In [7]:
df.head(2)

    Name  Marks       City
0   Asim     80     Amroha
1  Najim     90  Moradabad

In [8]:
df.tail(2)

     Name  Marks    City
2   Salim     85   Delhi
3  Faizan     70  Meerut

In [9]:
df.describe()

           Marks
count   4.000000
mean   81.250000
std     8.539126
min    70.000000
25%    77.500000
50%    82.500000
75%    86.250000
max    90.000000

In [10]:
Asim = pd.read_csv("Asim.csv")

In [11]:
Asim

   Train NO.  Speed       City
0     123453     50     Amroha
1      23412     90  Moradabad
2     243222     85      Delhi
3     232322     70     Meerut

In [12]:
Asim["Speed"][0] = 50

C:\Users\asimk\AppData\Local\Temp\ipykernel_11828\683637805.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  Asim["Speed"][0] = 50
C:\Users\asimk\AppData\Local\Temp\ipykernel_11828\683637805.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Asim["Speed"][0] = 50

In [13]:
Asim

   Train NO.  Speed       City
0     123453     50     Amroha
1      23412     90  Moradabad
2     243222     85      Delhi
3     232322     70     Meerut

In [14]:
Asim.to_csv('Asim.csv', index=False)

In [15]:
ser = pd.Series(np.random.rand(34))

In [16]:
ser.head()

0    0.246673
1    0.425760
2    0.369474
3    0.658540
4    0.857501
dtype: float64

In [17]:
type(ser)

pandas.core.series.Series

In [18]:
newdf = pd.DataFrame(np.random.rand(334, 5), index=np.arange(334))

In [19]:
newdf.head(5)

          0         1         2         3         4
0  0.801772  0.340458  0.528354  0.086867  0.792700
1  0.682802  0.260730  0.231797  0.678429  0.125358
2  0.100771  0.609212  0.483404  0.766376  0.204006
3  0.738176  0.080914  0.126878  0.520685  0.442061
4  0.552064  0.043520  0.778963  0.120532  0.690354

In [20]:
type(newdf)

pandas.core.frame.DataFrame

In [21]:
newdf.to_csv("Data1.csv", index=False)

In [22]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [23]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.501145    0.507319    0.496475    0.485612    0.518472
std      0.297593    0.291199    0.286401    0.280163    0.278039
min      0.003574    0.000557    0.003217    0.002061    0.005964
25%      0.248273    0.270778    0.255292    0.258805    0.300680
50%      0.513905    0.505413    0.497168    0.463637    0.532332
75%      0.743894    0.774019    0.752924    0.708449    0.752678
max      0.999265    0.999913    0.996909    0.999751    0.999130

In [24]:
newdf[0][0] = ["Asim"]

C:\Users\asimk\AppData\Local\Temp\ipykernel_11828\511502278.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0] = ["Asim"]
C:\Users\asimk\AppData\Local\Temp\ipykernel_11828\511502278.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '['Asim']' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0] = ["Asim"]

In [25]:
newdf.head()

          0         1         2         3         4
0    [Asim]  0.340458  0.528354  0.086867  0.792700
1  0.682802  0.260730  0.231797  0.678429  0.125358
2  0.100771  0.609212  0.483404  0.766376  0.204006
3  0.738176  0.080914  0.126878  0.520685  0.442061
4  0.552064  0.043520  0.778963  0.120532  0.690354

In [26]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [27]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [28]:
ser = pd.Series([1, 4, "Asim"], index=['a', 'b', 'c'])

In [29]:
ser

a       1
b       4
c    Asim
dtype: object

In [30]:
ndf = pd.DataFrame(np.random.rand(200, 5), index=(np.arange(200)))

In [31]:
ndf.to_csv("DataFrame.csv", index=False)

In [32]:
ndf.iloc[0]

0    0.893813
1    0.964574
2    0.483774
3    0.456064
4    0.268180
Name: 0, dtype: float64

In [33]:
df.loc[0, "Name"]

'Asim'

In [34]:
df1 = pd.read_csv("sample_data_100_rows - Copy.csv")

In [35]:
df1.shape

(100, 5)

In [36]:
df1.head()

    ID     Name   Age    Salary Department
0  1.0      NaN   NaN       NaN        NaN
1  2.0  Charlie  46.0       NaN         HR
2  3.0     Jack   NaN   97340.0        NaN
3  4.0      NaN  31.0   86707.0  Marketing
4  5.0     Jack  24.0  117304.0        NaN

#### if any row contain at least one Nan value dropna() method drop all row
#### if write like that df1.dropna(how="True")

In [37]:
df1.dropna().shape

(87, 5)

#### this method drop row if all columns contain NaN values

In [38]:
df1.dropna(how="all").shape

(99, 5)

#### if x = 0 mean if any row contain NaN value 
#### if x = 1 mean if any column contain NaN value
#### by default dropna() method set row (x=0)

In [39]:
df1.dropna(axis=1).shape

(100, 0)

#### how = "all" mean if column contain all values NaN

In [40]:
df1.dropna(axis=1, how="all").shape

(100, 5)

#### subset method show perticular column contain howmany NaN value

In [41]:
df1.dropna(subset=["Name"]).shape

(97, 5)

#### fillna() method fill the NaN value with the given value

In [42]:
df1.fillna(0)

       ID     Name   Age    Salary Department
0     1.0        0   0.0       0.0          0
1     2.0  Charlie  46.0       0.0         HR
2     3.0     Jack   0.0   97340.0          0
3     4.0        0  31.0   86707.0  Marketing
4     5.0     Jack  24.0  117304.0          0
..    ...      ...   ...       ...        ...
95   96.0    David  29.0  114891.0  Marketing
96   97.0    Grace  50.0   60185.0         IT
97   98.0    Grace  25.0   60976.0  Marketing
98   99.0      Eve  26.0   45558.0    Finance
99  100.0    Grace  44.0   55409.0      Sales

[100 rows x 5 columns]

##### how to rename column name

In [43]:
df1.rename(columns={"Salary" : "Sal"})

       ID     Name   Age       Sal Department
0     1.0      NaN   NaN       NaN        NaN
1     2.0  Charlie  46.0       NaN         HR
2     3.0     Jack   NaN   97340.0        NaN
3     4.0      NaN  31.0   86707.0  Marketing
4     5.0     Jack  24.0  117304.0        NaN
..    ...      ...   ...       ...        ...
95   96.0    David  29.0  114891.0  Marketing
96   97.0    Grace  50.0   60185.0         IT
97   98.0    Grace  25.0   60976.0  Marketing
98   99.0      Eve  26.0   45558.0    Finance
99  100.0    Grace  44.0   55409.0      Sales

[100 rows x 5 columns]

In [44]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          97 non-null     float64
 1   Name        97 non-null     object
 2   Age         94 non-null     float64
 3   Salary      96 non-null     float64
 4   Department  93 non-null     object
dtypes: float64(3), object(2)
memory usage: 4.0+ KB

##### if we want to change column data type if column contain Nan value then give error

In [48]:
df1["Salary"] = df1["Salary"].fillna(0).astype(int)

In [50]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          97 non-null     float64
 1   Name        97 non-null     object
 2   Age         94 non-null     float64
 3   Salary      100 non-null    int64
 4   Department  93 non-null     object
dtypes: float64(2), int64(1), object(2)
memory usage: 4.0+ KB

##### len() function return rows (how many rows in the data frame)

In [53]:
len(df1)

100

##### add new column

In [59]:
df1["Zeros"] = [0 for i in range(len(df1))]

In [58]:
df1.shape

(100, 6)

##### if we want to square of any column first add new column . we can do this

In [65]:
def fun(a):
    return a * a
df1["Zeros + 1"] = df1["Zeros"].apply(fun)

In [66]:
df1

       ID     Name   Age  Salary Department  Zeros  Zeros + 1
0     1.0      NaN   NaN       0        NaN      0          0
1     2.0  Charlie  46.0       0         HR      1          1
2     3.0     Jack   NaN   97340        NaN      2          4
3     4.0      NaN  31.0   86707  Marketing      3          9
4     5.0     Jack  24.0  117304        NaN      4         16
..    ...      ...   ...     ...        ...    ...        ...
95   96.0    David  29.0  114891  Marketing     95       9025
96   97.0    Grace  50.0   60185         IT     96       9216
97   98.0    Grace  25.0   60976  Marketing     97       9409
98   99.0      Eve  26.0   45558    Finance     98       9604
99  100.0    Grace  44.0   55409      Sales     99       9801

[100 rows x 7 columns]

In [67]:
df1.to_csv("export.csv", index=False)

##### Concatination of DataFrame using concat() fun. Syntax : pd.concat([dataFrame1, dataFrame2])

In [68]:
df2 = pd.DataFrame({
    "Name" : ["Vivek", "Santosh", "Raman"],
    "Marks" : [34, 65, 2]
})

In [69]:
df3 = pd.DataFrame({
    "Name" : ["Ravi", "Rohan", "Rahul"],
    "Marks" : [45, 1, 78]
})

In [70]:
pd.concat([df2, df3])

      Name  Marks
0    Vivek     34
1  Santosh     65
2    Raman      2
0     Ravi     45
1    Rohan      1
2    Rahul     78

merge data frame using merge function Syntax : pd.merge(dataFrame1, df2, on="coln_name")

In [71]:
df3 = pd.DataFrame({
    "Name" : ["Rihan", "Wasi"], 
    "Marks" : [70, 34]
})

In [72]:
df4 = pd.DataFrame({
    "Name" : ["Rihan", "Wasi"],
    "Roll No." : [1233, 1245]
})

In [73]:
pd.merge(df3, df4, on="Name")

    Name  Marks  Roll No.
0  Rihan     70      1233
1   Wasi     34      1245